In [21]:
import numpy as np
import pandas as pd

In [22]:
data = {'A':[1,2,np.nan],'B':[15,np.nan,np.nan],'C':[1,2,3]}

In [23]:
df = pd.DataFrame(data)
df

     A     B  C
0  1.0  15.0  1
1  2.0   NaN  2
2  NaN   NaN  3

In [24]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [25]:
df.dropna(thresh=2)

     A     B  C
0  1.0  15.0  1
1  2.0   NaN  2

In [26]:
df.fillna(value="Fill Value")

            A           B  C
0         1.0        15.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [27]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64